wrk_results_2026-03-24_15-27-48.log
=== WRK MEASUREMENT LOG ===


=== threads=4, connections=10 ===
COMMAND: wrk -c10 -d10s -t4 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    38.08ms    2.49ms  55.35ms   83.63%
    Req/Sec    52.37      6.46    60.00     52.75%
  2095 requests in 10.01s, 601.49KB read
Requests/sec:    209.38
Transfer/sec:     60.12KB


STDERR:


----------------------------------------

=== threads=4, connections=25 ===
COMMAND: wrk -c25 -d10s -t4 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  4 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   110.61ms    4.60ms 130.69ms   98.29%
    Req/Sec    54.01      9.71    60.00     83.96%
  2158 requests in 10.01s, 619.58KB read
Requests/sec:    215.51
Transfer/sec:     61.87KB


STDERR:


----------------------------------------

=== threads=4, connections=50 ===
COMMAND: wrk -c50 -d10s -t4 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   228.59ms   11.62ms 316.50ms   97.16%
    Req/Sec    52.28     25.86   111.00     56.57%
  2077 requests in 10.01s, 596.33KB read
Requests/sec:    207.56
Transfer/sec:     59.59KB


STDERR:


----------------------------------------

=== threads=4, connections=100 ===
COMMAND: wrk -c100 -d10s -t4 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   480.05ms   31.34ms 697.04ms   95.67%
    Req/Sec    53.44     30.01   171.00     68.59%
  2033 requests in 10.02s, 583.69KB read
Requests/sec:    202.96
Transfer/sec:     58.27KB


STDERR:


----------------------------------------

=== threads=4, connections=500 ===
COMMAND: wrk -c500 -d10s -t4 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.21s   443.38ms   1.99s    58.73%
    Req/Sec    63.34     35.69   191.00     75.77%
  1750 requests in 10.04s, 502.44KB read
  Socket errors: connect 0, read 0, write 0, timeout 1435
Requests/sec:    174.37
Transfer/sec:     50.06KB


STDERR:


----------------------------------------

=== threads=4, connections=1000 ===
COMMAND: wrk -c1000 -d10s -t4 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  4 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec    64.82     30.35   191.00     84.57%
  1189 requests in 10.05s, 341.37KB read
  Socket errors: connect 0, read 0, write 0, timeout 1189
Requests/sec:    118.29
Transfer/sec:     33.96KB


STDERR:


----------------------------------------

=== threads=8, connections=10 ===
COMMAND: wrk -c10 -d10s -t8 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  8 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    44.12ms    2.85ms  51.81ms   80.17%
    Req/Sec    22.11      5.47    30.00     72.33%
  820 requests in 10.01s, 235.43KB read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:     81.91
Transfer/sec:     23.52KB


STDERR:


----------------------------------------

=== threads=8, connections=25 ===
COMMAND: wrk -c25 -d10s -t8 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  8 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   132.17ms    7.22ms 164.15ms   89.97%
    Req/Sec    22.82      7.20    30.00     82.17%
  1805 requests in 10.01s, 518.23KB read
Requests/sec:    180.26
Transfer/sec:     51.75KB


STDERR:


----------------------------------------

=== threads=8, connections=50 ===
COMMAND: wrk -c50 -d10s -t8 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   264.47ms   13.60ms 384.14ms   97.27%
    Req/Sec    23.61     11.13    50.00     68.29%
  1792 requests in 10.01s, 514.50KB read
Requests/sec:    179.03
Transfer/sec:     51.40KB


STDERR:


----------------------------------------

=== threads=8, connections=100 ===
COMMAND: wrk -c100 -d10s -t8 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   522.02ms   36.96ms 779.36ms   95.48%
    Req/Sec    35.72     30.80   111.00     68.69%
  1791 requests in 10.02s, 514.21KB read
Requests/sec:    178.76
Transfer/sec:     51.32KB


STDERR:


----------------------------------------

=== threads=8, connections=500 ===
COMMAND: wrk -c500 -d10s -t8 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.25s   434.04ms   1.99s    57.51%
    Req/Sec    49.06     30.34   191.00     70.36%
  1722 requests in 10.02s, 494.40KB read
  Socket errors: connect 0, read 0, write 0, timeout 1449
Requests/sec:    171.83
Transfer/sec:     49.34KB


STDERR:


----------------------------------------

=== threads=8, connections=1000 ===
COMMAND: wrk -c1000 -d10s -t8 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  8 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec    49.71     33.43   190.00     79.82%
  1195 requests in 10.04s, 343.10KB read
  Socket errors: connect 0, read 0, write 0, timeout 1195
Requests/sec:    119.05
Transfer/sec:     34.18KB


STDERR:


----------------------------------------