wrk_results_2026-03-24_15-34-47.log
=== WRK MEASUREMENT LOG ===


=== threads=4, connections=100 ===
COMMAND: wrk -c100 -d10s -t4 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   470.20ms   58.08ms 491.93ms   95.96%
    Req/Sec    52.31     20.37   131.00     74.05%
  2077 requests in 10.02s, 596.33KB read
Requests/sec:    207.30
Transfer/sec:     59.52KB


STDERR:


----------------------------------------

=== threads=4, connections=200 ===
COMMAND: wrk -c200 -d10s -t4 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   959.64ms   88.86ms   1.41s    91.84%
    Req/Sec    60.58     35.41   232.00     81.37%
  1985 requests in 10.02s, 569.91KB read
Requests/sec:    198.03
Transfer/sec:     56.86KB


STDERR:


----------------------------------------

=== threads=4, connections=300 ===
COMMAND: wrk -c300 -d10s -t4 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  4 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.45s   108.51ms   1.99s    90.16%
    Req/Sec    68.70     45.86   230.00     73.06%
  1887 requests in 10.04s, 541.78KB read
  Socket errors: connect 0, read 0, write 0, timeout 78
Requests/sec:    187.94
Transfer/sec:     53.96KB


STDERR:


----------------------------------------

=== threads=4, connections=400 ===
COMMAND: wrk -c400 -d10s -t4 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  4 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.91s    83.10ms   2.00s    93.94%
    Req/Sec    66.84     38.27   220.00     79.12%
  1790 requests in 10.04s, 513.93KB read
  Socket errors: connect 0, read 0, write 0, timeout 272
Requests/sec:    178.24
Transfer/sec:     51.18KB


STDERR:


----------------------------------------

=== threads=4, connections=500 ===
COMMAND: wrk -c500 -d10s -t4 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec    53.78     28.37   191.00     82.86%
  1413 requests in 10.05s, 405.69KB read
  Socket errors: connect 0, read 0, write 0, timeout 1413
Requests/sec:    140.61
Transfer/sec:     40.37KB


STDERR:


----------------------------------------

=== threads=8, connections=100 ===
COMMAND: wrk -c100 -d10s -t8 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   532.19ms    2.81ms 543.43ms   76.83%
    Req/Sec    30.73     23.26   101.00     71.66%
  1309 requests in 10.02s, 375.83KB read
  Socket errors: connect 0, read 0, write 0, timeout 96
Requests/sec:    130.68
Transfer/sec:     37.52KB


STDERR:


----------------------------------------

=== threads=8, connections=200 ===
COMMAND: wrk -c200 -d10s -t8 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  8 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.10s   108.55ms   1.60s    90.80%
    Req/Sec    51.82     46.50   190.00     72.44%
  1718 requests in 10.03s, 493.25KB read
Requests/sec:    171.36
Transfer/sec:     49.20KB


STDERR:


----------------------------------------

=== threads=8, connections=300 ===
COMMAND: wrk -c300 -d10s -t8 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  8 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.62s    96.52ms   1.99s    90.94%
    Req/Sec    43.75     31.96   161.00     61.29%
  1618 requests in 10.10s, 464.54KB read
  Socket errors: connect 0, read 0, write 0, timeout 128
Requests/sec:    160.20
Transfer/sec:     46.00KB


STDERR:


----------------------------------------

=== threads=8, connections=400 ===
COMMAND: wrk -c400 -d10s -t8 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.75s   140.96ms   2.00s    57.78%
    Req/Sec    46.78     33.62   190.00     69.12%
  1537 requests in 10.03s, 441.29KB read
  Socket errors: connect 0, read 0, write 0, timeout 1447
Requests/sec:    153.29
Transfer/sec:     44.01KB


STDERR:


----------------------------------------

=== threads=8, connections=500 ===
COMMAND: wrk -c500 -d10s -t8 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec    49.45     28.71   180.00     67.97%
  1418 requests in 10.01s, 407.12KB read
  Socket errors: connect 0, read 0, write 0, timeout 1418
Requests/sec:    141.61
Transfer/sec:     40.66KB


STDERR:


----------------------------------------